In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
create database uber;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [3]:
%%sql
use uber;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE rides (
    ride_id INT PRIMARY KEY, #primary key
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [5]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [6]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [7]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 102, 202, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'rides.PRIMARY'
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 102, 202, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [11]:
%%sql
CREATE TABLE rides_1 (
    ride_id INT,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL,
    primary key (ride_id,rider_id) #composite primary key
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [18]:
%%sql
INSERT INTO rides_1 (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(2, 102, 201, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [14]:
%%sql
desc rides_1;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [19]:
%%sql
select * from rides_1;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 102, 201, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00')),
 (1, 102, 202, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00')),
 (2, 102, 201, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00'))]

In [ ]:
#unique constraint

In [20]:
%%sql
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [21]:
%%sql
INSERT INTO users (user_id, email)
VALUES (1, 'user1@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [22]:
%%sql
INSERT INTO users (user_id, email)
VALUES (2, 'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [23]:
%%sql
INSERT INTO users (user_id, email)
VALUES (3, null);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [24]:
%%sql
INSERT INTO users (user_id, email)
VALUES (4, 'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'user2@example.com' for key 'users.email'
[SQL: INSERT INTO users (user_id, email)
VALUES (4, 'user2@example.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
#NOT NULL Constraint Failure

In [25]:
%%sql
CREATE TABLE rides_3(
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 103, 203, 'Coimbatore', 'Chennai', '2024-12-29 14:00:00', 600.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(4, 104, 204, 'pudukottai', 'Chennai', '2024-12-29 16:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [ ]:
#Check Constraint

In [31]:
%%sql
CREATE TABLE rides_4 (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) CHECK (fare > 0)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [ ]:
#Foreign Key Constraint

In [32]:
%%sql
CREATE TABLE drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

CREATE TABLE rides_5 (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [33]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES (101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [35]:
%%sql
INSERT INTO rides_5 (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [36]:
%%sql
INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (304, 999, 'Coimbatore', 'Chennai', '2024-12-03 10:00:00', 800.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.DatabaseError) 1364 (HY000): Field 'rider_id' doesn't have a default value
[SQL: INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (304, 999, 'Coimbatore', 'Chennai', '2024-12-03 10:00:00', 800.00);]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [37]:
%%sql
DELETE FROM drivers WHERE driver_id = 101;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1451 (23000): Cannot delete or update a parent row: a foreign key constraint fails (`uber`.`rides_5`, CONSTRAINT `rides_5_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))
[SQL: DELETE FROM drivers WHERE driver_id = 101;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [42]:
%%sql
drop table if exists rides_5;

drop table if exists drivers;

CREATE TABLE drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

CREATE TABLE rides_5 (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id) ON DELETE CASCADE  #ON DELETE CASCADE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [43]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES (101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [44]:
%%sql
INSERT INTO rides_5 (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [45]:
%%sql
DELETE FROM drivers WHERE driver_id = 101;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [46]:
%%sql
select * from drivers;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(102, 'Jane Smith', 'ABC67890')]

In [51]:
%%sql
select * from rides_5;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'), 1)]

In [ ]:
#soft delete

In [48]:
%%sql
alter table rides_5 add column on_delete boolean default false

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [50]:
%%sql
update rides_5 set on_delete=true where driver_id=102

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [52]:
%%sql
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    country VARCHAR(50) DEFAULT 'India'
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [53]:
%%sql
INSERT INTO customers (customer_id, customer_name, country)
VALUES (1, 'John Doe', 'USA');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [54]:
%%sql
INSERT INTO customers (customer_id, customer_name)
VALUES (2, 'Jane Smith');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [56]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'John Doe', 'USA'), (2, 'Jane Smith', 'India')]

In [ ]:
#minimal key if compostion primary key reduced to one means minimal key otherwise non-minimal key
#example: constraints pk_enroll (stu_id,course_id) non minimal key
#example: constraints pk_enroll (stu_id)  minimal key

In [ ]:
#Natural Key: Real data with business meaning, used as an identifier.
#Surrogate Key: Artificial (often numeric) identifier, stable and system-generated.

In [ ]:
CREATE TABLE dim_customer (
    customer_key INT AUTO_INCREMENT ,         -- Surrogate Key (unique for each version of the customer record)
    aadhar_number INT NOT NULL PRIMARY KEY,   -- Natural Key (unique identifier for the customer)
    customer_name VARCHAR(100),
    city VARCHAR(100),
    effective_date DATE,              -- Date this record version became active
    end_date DATE,                    -- Date this record version ended
    is_current BOOLEAN                -- Flag to indicate the current active record
);

In [ ]:
#Candidate Key all primary keys are candidate keys only

In [ ]:
CREATE TABLE Enrollment (
    student_id INT NOT NULL,
    course_id INT NOT NULL,
    enrollment_date DATE,
	course_name varchar(100),
	

	
    CONSTRAINT pk_enrollment PRIMARY KEY (student_id, course_id)
);


    CONSTRAINT pk_enrollment PRIMARY KEY (student_id)  #Candidate Key 
    CONSTRAINT pk_enrollment PRIMARY KEY (student_id, course_id) #Candidate Key
    CONSTRAINT pk_enrollment PRIMARY KEY (student_id, course_id, course_name) #non-Candidate Key because course name is not unique

In [ ]:
#super key all primary keys and optional keys also a super keys
#example  CONSTRAINT pk_enrollment PRIMARY KEY (student_id, course_id, course_name)here course name is their so  super keys not candidate key